import Topbar from '@/components/topbar';
import React from 'react';

const PrivacyPolicyPage = () => {
    return (
        <div>
            <Topbar backHref="/start/login">Политика конфиденциальности</Topbar>
            <p className="p-5">
                Вот вам яркий пример современных тенденций — сложившаяся
                структура организации предопределяет высокую востребованность
                приоретизации разума над эмоциями! Лишь элементы политического
                процесса могут быть призваны к ответу. Господа, глубокий уровень
                погружения прекрасно подходит для реализации своевременного
                выполнения сверхзадачи. Таким образом, современная методология
                разработки, в своём классическом представлении, допускает
                внедрение поэтапного и последовательного развития общества. Для
                современного мира современная методология разработки создаёт
                необходимость включения в производственный план целого ряда
                внеочередных мероприятий с учётом комплекса приоретизации разума
                над эмоциями. И нет сомнений, что действия представителей
                оппозиции могут быть объективно рассмотрены соответствующими
                инстанциями.
            </p>
        </div>
    );
};

export default PrivacyPolicyPage;
