import Topbar from '@/components/topbar';
import React from 'react';

const PrivacyPolicyPage = () => {
    return (
        <div>
            <Topbar backHref="/start/login">Политика конфиденциальности</Topbar>
            <div className="p-5">
                <h1 className="mb-6 text-2xl font-semibold">
                    Политика конфиденциальности и обработки персональных данных
                </h1>
                <p className="mb-6">
                    Настоящая политика конфиденциальности и обработки
                    персональных данных регулирует порядок обработки и
                    использования персональных и иных данных ТОО « JOOOL»
                    (дальше — Компания). Действующая редакция настоящей Политики
                    конфиденциальности, постоянно доступна для ознакомления, и
                    размещена в приложение «Joool»
                </p>
                <p className="mb-6">
                    Передавая Компании персональные и иные данные посредством
                    приложения «Joool», Пользователь подтверждает свое согласие
                    на использование указанных данных на условиях, изложенных в
                    настоящей Политике конфиденциальности.
                </p>
                <p className="mb-6">
                    Если Пользователь не согласен с условиями настоящей Политики
                    конфиденциальности, он обязан прекратить использование
                    приложения «Joool»
                </p>
                <p className="mb-6">
                    Безусловным акцептом настоящей Политики конфиденциальности
                    является начало использования приложения
                    «Joool»Пользователем.
                </p>
                <h2 className="mb-4 mt-8 text-2xl font-semibold">1. ТЕРМИНЫ</h2>
                <ul className="ml-6 list-disc space-y-4">
                    <li>
                        1.1. Приложение «Joool» расположено в сети в
                        маркетплейсах в открытых источниках. Все исключительные
                        права на приложение «Joool» и его отдельные элементы
                        (включая программное обеспечение, дизайн) принадлежат
                        Компании в полном объеме. Передача исключительных прав
                        Пользователю не является предметом настоящей Политики
                        конфиденциальности.
                    </li>
                    <li>
                        1.2. Пользователь — лицо использующее приложение
                        «Joool».
                    </li>
                    <li>
                        1.3. Законодательство — действующее законодательство
                        Республики Казахстан.
                    </li>
                    <li>
                        1.4. Персональные данные — персональные данные
                        Пользователя, которые Пользователь предоставляет
                        самостоятельно при регистрации или в процессе
                        использования функционала приложения «Joool»
                    </li>
                    <li>
                        1.5. Данные — иные данные о Пользователе (не входящие в
                        понятие Персональных данных).
                    </li>
                    <li>
                        1.6. Регистрация — заполнение Пользователем
                        Регистрационной формы, расположенной в приложение
                        «Joool» путем указания необходимых сведений.
                    </li>
                    <li>
                        1.7. Регистрационная форма — форма, расположенная
                        приложение «Joool» которую Пользователь должен заполнить
                        для возможности использования приложение «Joool» в
                        полном объеме.
                    </li>
                    <li>
                        1.8. Услуга(и) — услуги, предоставляемые Компание на
                        основании соглашения.
                    </li>
                </ul>
                <h2 className="mb-4 mt-8 text-2xl font-semibold">
                    2. СБОР И ОБРАБОТКА ПЕРСОНАЛЬНЫХ ДАННЫХ
                </h2>
                <ul className="ml-6 list-disc space-y-4">
                    <li>
                        2.1. Компания собирает и хранит только те Персональные
                        данные, которые необходимы для оказания Услуг Компанией
                        и взаимодействия с Пользователем.
                    </li>
                    <li>
                        2.2. Персональные данные могут использоваться в
                        следующих целях:
                        <ul className="ml-6 mt-2 list-decimal space-y-2">
                            <li>оказание Услуг Пользователю;</li>
                            <li>идентификация Пользователя;</li>
                            <li>взаимодействие с Пользователем;</li>
                            <li>
                                направление Пользователю рекламных материалов,
                                информации и запросов;
                            </li>
                            <li>
                                Передачи данных контрагентам по вопросам
                                оказания услуги;
                            </li>
                        </ul>
                    </li>
                    <li>
                        2.3. Компания в том числе обрабатывает следующие данные:
                        <ul className="ml-6 mt-2 list-decimal space-y-2">
                            <li>фамилия, имя и отчество;</li>
                            <li>адрес электронной почты;</li>
                            <li>номер телефона (в т.ч. мобильного)</li>
                            <li>Банковские реквизиты</li>
                            <li>Индикационные индивидуальный номер</li>
                            <li>Номер удостоверения/ паспортные данные</li>
                        </ul>
                    </li>
                    <li>
                        2.4. Пользователю запрещается указывать в приложение
                        «Joool» персональные данные третьих лиц (за исключением
                        условия представления интересов этих лиц, имея
                        документальное подтверждение третьих лиц на
                        осуществление таких действий).
                    </li>
                </ul>
                <h2 className="mb-4 mt-8 text-2xl font-semibold">
                    3. ПОРЯДОК ОБРАБОТКИ ПЕРСОНАЛЬНЫХ И ИНЫХ ДАННЫХ
                </h2>
                <ul className="ml-6 list-disc space-y-4">
                    <li>
                        3.1. Компания обязуется использовать Персональные данные
                        в соответствии с Законом «О персональных данных»
                        Республики Казахстан и внутренними положениями.
                    </li>
                    <li>
                        3.2. В отношении Персональных данных и иных Данных
                        Пользователя сохраняется их конфиденциальность, кроме
                        случаев, когда указанные данные являются общедоступными.
                    </li>
                    <li>
                        3.3. Компания имеет право сохранять архивную копию
                        Персональных данных. Компания имеет право хранить
                        Персональные данные и Данные на серверах вне территории
                        Республики Казахстан.
                    </li>
                    <li>
                        3.4. Компания имеет право передавать Персональные данные
                        и Данные Пользователя без согласия Пользователя
                        следующим лицам:
                        <ul className="ml-6 mt-2 list-decimal space-y-2">
                            <li>
                                государственным органам, в том числе органам
                                дознания и следствия, и органам местного
                                самоуправления по их мотивированному запросу;
                            </li>
                            <li>
                                Непросредственном третьим лицам кто оказывает
                                услугу;
                            </li>
                            <li>
                                в иных случаях, прямо предусмотренных
                                действующим законодательством Республики
                                Казахстан.
                            </li>
                        </ul>
                    </li>
                    <li>
                        3.5. Компания имеет право передавать Персональные данные
                        третьим лицам, не указанным в п.3.4. настоящей Политики
                        конфиденциальности, в следующих случаях:
                        <ul className="ml-6 mt-2 list-decimal space-y-2">
                            <li>
                                Пользователь выразил свое согласие на такие
                                действия;
                            </li>
                            <li>
                                передача необходима в рамках использования
                                Пользователем приложения «Joool» или оказания
                                Услуг Пользователю;
                            </li>
                        </ul>
                    </li>
                    <li>
                        3.6. Компания осуществляет автоматизированную обработку
                        Персональных данных и Данных.
                    </li>
                </ul>
                <h2 className="mb-4 mt-8 text-2xl font-semibold">
                    4. ЗАЩИТА ПЕРСОНАЛЬНЫХ ДАННЫХ
                </h2>
                <ul className="ml-6 list-disc space-y-4">
                    <li>
                        4.1. Компания осуществляет надлежащую защиту
                        Персональных и иных данных в соответствии с
                        Законодательством и принимает необходимые и достаточные
                        организационные и технические меры для защиты
                        Персональных данных.
                    </li>
                    <li>
                        4.2. Применяемые меры защиты в том числе позволяют
                        защитить Персональные данные от неправомерного или
                        случайного доступа, уничтожения, изменения,
                        блокирования, копирования, распространения, а также от
                        иных неправомерных действий с ними третьих лиц.
                    </li>
                </ul>
                <h2 className="mb-4 mt-8 text-2xl font-semibold">
                    5. ИНЫЕ ПОЛОЖЕНИЯ
                </h2>
                <ul className="ml-6 list-disc space-y-4">
                    <li>
                        5.1. К настоящей Политике конфиденциальности и
                        отношениям между Пользователем и Компанией, возникающим
                        в связи с применением Политики конфиденциальности,
                        подлежит применению право Республики Казахстан.
                    </li>
                    <li>
                        5.2. Все возможные споры, вытекающие из настоящего
                        Соглашения, подлежат разрешению в соответствии с
                        действующим законодательством по месту регистрации
                        Компании. Перед обращением в суд Пользователь должен
                        соблюсти обязательный до судебный порядок и направить
                        Компании соответствующую претензию в письменном виде.
                        Срок ответа на претензию составляет 30 (тридцать)
                        рабочих дней.
                    </li>
                    <li>
                        5.3. Если по тем или иным причинам одно или несколько
                        положений Политики конфиденциальности будут признаны
                        недействительными или не имеющими юридической силы, это
                        не оказывает влияния на действительность или
                        применимость остальных положений Политики
                        конфиденциальности.
                    </li>
                    <li>
                        5.4. Компания имеет право в любой момент изменять
                        Политику конфиденциальности (полностью или в части) в
                        одностороннем порядке без предварительного согласования
                        с Пользователем. Все изменения вступают в силу с момента
                        ее размещения в приложение «Joool»
                    </li>
                    <li>
                        5.5. Пользователь обязуется самостоятельно следить за
                        изменениями Политики конфиденциальности путем
                        ознакомления с актуальной редакцией.
                    </li>
                    <li>
                        5.6. Все предложения или вопросы по настоящей Политике
                        конфиденциальности следует сообщать по электронной
                        почте: joool.bus@gmail.com или по телефонам: +7 708 520
                        7059
                    </li>
                </ul>
            </div>
        </div>
    );
};

export default PrivacyPolicyPage;
