import React from 'react'

const FAQPage1 = () => {
    return (
        <div className='p-5'>
            <div className='text-[32px] font-medium leading-[35.2px] tracking-[-3%]'>
                Условия возврата средств
            </div>
            <div className='font-normal text-[16px] leading-[24px] tracking-[-3%] pt-3'>
                С учётом сложившейся международной обстановки, сложившаяся
                структура организации говорит о возможностях инновационных
                методов управления процессами. Являясь всего лишь частью
                общей картины, явные признаки победы институционализации,
                инициированные исключительно синтетически, описаны
                максимально подробно.
            </div>
            <div className='font-normal text-[16px] leading-[24px] tracking-[-3%] pt-5'>
                В частности, внедрение современных методик позволяет
                выполнить важные задания по разработке стандартных
                подходов. Банальные, но неопровержимые выводы, а
                также многие известные личности формируют глобальную
                экономическую сеть и при этом — превращены в посмешище,
                хотя само их существование приносит
                несомненную пользу обществу.
            </div>
        </div>
    )
}

export default FAQPage1;