import Topbar from '@/components/topbar';
import React from 'react';

const ConfidentialityPage = () => {
    return (
        <>
            <Topbar backHref="/profile">Конфиденциальность</Topbar>
            <div className="mb-4 mt-8 px-5">
                <div>
                    <div className="text-[32px] font-medium leading-[35.2px] tracking-[-3%]">
                        Политика конфиденциальности
                    </div>
                    <div className="pt-3 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        С учётом сложившейся международной обстановки,
                        сложившаяся структура организации говорит о возможностях
                        инновационных методов управления процессами. Являясь
                        всего лишь частью общей картины, явные признаки победы
                        институционализации, инициированные исключительно
                        синтетически, описаны максимально подробно.
                    </div>
                    <div className="pt-5 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        В частности, внедрение современных методик позволяет
                        выполнить важные задания по разработке стандартных
                        подходов. Банальные, но неопровержимые выводы, а также
                        многие известные личности формируют глобальную
                        экономическую сеть и при этом — превращены в посмешище,
                        хотя само их существование приносит несомненную пользу
                        обществу.
                    </div>
                </div>
                <div className="pt-10">
                    <div className="text-[32px] font-medium leading-[35.2px] tracking-[-3%]">
                        Договор офферты
                    </div>
                    <div className="pt-3 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        С учётом сложившейся международной обстановки,
                        сложившаяся структура организации говорит о возможностях
                        инновационных методов управления процессами. Являясь
                        всего лишь частью общей картины, явные признаки победы
                        институционализации, инициированные исключительно
                        синтетически, описаны максимально подробно.
                    </div>
                    <div className="pt-5 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        В частности, внедрение современных методик позволяет
                        выполнить важные задания по разработке стандартных
                        подходов. Банальные, но неопровержимые выводы, а также
                        многие известные личности формируют глобальную
                        экономическую сеть и при этом — превращены в посмешище,
                        хотя само их существование приносит несомненную пользу
                        обществу.
                    </div>
                </div>
            </div>
        </>
    );
};

export default ConfidentialityPage;
