import Topbar from '@/components/topbar';
import React from 'react';

const ConfidentialityPage = () => {
    return (
        <>
            <Topbar backHref="/profile">Конфиденциальность</Topbar>
            <div className="mb-4 mt-8 px-5">
                <div>
                    <div className="text-[32px] font-medium leading-[35.2px] tracking-[-3%]">
                        Политика конфиденциальности
                    </div>
                    <div className="pt-3 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        Настоящее предложение Товарищество с ограниченной ответственностью «JOOOL» (далее – Компания) в лице Генерального директора Талдыбаевой Зарины Аскаровный, действующего (ей) на основании Устава, юридический адрес: Республика Казахстан, Алматинская оласть, Карасайский районо, Иргелинский сельский округ, Жиловй массив АСЫЛ-АРМАН, дом 4, кв 215,  электронный адрес: joool.bus@gmail.com, является Публичной офертой, по которой Компания делает предложение заключить Договор оказания услуг, которые оказываются с применением информационных технологий, на указанных в предложении условиях с любым, кто пройдет регистрацию в приложение «Joool» .
                    </div>
                    <div className="pt-5 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        Данное предложение содержит все существенные условия, т.е. условия, которые признаны существенными законодательством или необходимы для оказания информационных услуг, а именно поиск маршрутов/ Автобусов по территории Республики Казахстан и за ее пределами, а также те условия.
                        <br /> <br />
                        Настоящее Соглашение является публичной офертой Компании разработчика приложения «Joool». Используя Приложение, в том числе, путем поиска удобного автотранспорта или удобного маршрута по территории Республики Казахстан и за ее пределами через Приложение, Пользователь подтверждает, что он ознакомлен и согласен с пользовательским соглашением Приложения  что означает присоединение Пользователя к настоящему Соглашению и безоговорочное принятие его условий.
                        <br /> <br />
                        Понятия и термины, используемые в настоящемм пользовательском соглашение

                        Информационные услуги –Доступ и пользование приложением «Joool».




                    </div>
                </div>
                <div className="pt-10">
                    <div className="text-[32px] font-medium leading-[35.2px] tracking-[-3%]">
                        Договор офферты
                    </div>
                    <div className="pt-3 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                        - настоящее предложение, которое делает Исполнитель любому, кто отзовется, и которое содержит все существенные условия. Данное предложение содержит все условия, которые признаны существенными законодательством или необходимы для оказания Услуг, а также те условия, относительно которых по заявлению должно быть достигнуто соглашение;
                        <br />1.3. Акцепт
                        <br />- ответ Пользователя или совершение Пользователем действий, определенных Пользовательским соглашением, свидетельствующих о полном и безоговорочном принятии условий Пользовательского соглашения.
                        <br />1.4. Информационная технология
                        <br />- совокупность методов, производственных процессов и программно-технических средств, объединенных в технологический комплекс, обеспечивающий сбор, создание, хранение, накопление, обработку, поиск, вывод, копирование, передачу и распространение информации;
                        <br />1.5. Приложение
                        <br />-  «Joool» интеллектуальная собственность ТОО «JOOOL» все права зарегистрированы в уполномоченных органах. (в текстовом, графическом, аудиовизуальном или ином виде), размещенная на маркетплейсах в открытом доступе;
                        <br />1.6. Компания
                        <br />-Сторона по договору правообладатель приложения «Joool», отвечающая за работу приложения, принимающая корреспонденцию и т.д.
                        <br />1.7. Посетитель
                        <br />- лицо, скачавшее и посетившее Приложение, без цели регистрации на нем или получения услуг;
                        <br />1.8. Пользователь
                        <br />— дееспособное физическое лицо, осуществившее Акцепт Договора-Оферты в собственном интересе либо выступающее от имени и в интересах представляемого им физического лица, законным представителем которого оно является. В случае, если Услуги предусмотрены для несовершеннолетних лиц, все права, обязанности и ответственность Пользователя по настоящему договору несут их законные представители. За достоверность предоставляемой информации несёт ответственность Пользователь.
                        <br />1.9. Заказ
                        <br />- задание Пользователя на оказание Услуг, оформленное в соответствии с условиями Договора-Оферты;
                        <br />1.10. Стороны
                        <br />– сторонами Договора-Оферты являются совместно Компания, а также Пользователь и третья сторона (которая непосредственно оказывает услугу);
                        <br />1.11. Персональные данные
                        <br />– сведения, регламентированные Пользовательским соглашением, относящиеся к определенному физическому лицу, зафиксированные на электронном, бумажном и (или) ином материальном носителе;
                        <br />1.12. Сбор Персональных данных
                        <br />– действия, направленные на получение Персональных данных;
                        <br />1.13. Обработка Персональных данных
                        <br />– действия, направленные на накопление, хранение, изменение, дополнение, использование, распространение, обезличивание, блокирование и уничтожение Персональных данных;
                        <br />1.14. Третьи лица
                        <br />– лица связанные, как в настоящее время, так и в будущем, с Компанией обстоятельствами или правоотношениями по Сбору, Обработке и защите Персональных данных Пользователя и предоставлением услуг.
                        <br />1.15. Менеджер
                        <br />– это специалист, который помогает Пользователям в случае обнаружение ошибок, багов, уточнение информации и т.д.
                        <br />1.16. Оплата
                        <br />–  К стоимости третьего лица прилагается комиссия компании в каждой услуги стоимость комиссии индивидуальна.
                        <br />1.17. Форма пользования
                        <br />– индивидуальная, дистанционная, посредством приложения «Joool»
                        <br />1.18. Третье лицо
                        <br />– юридическое лицо непосредственно оказывающее услуги, контрагент Компании.
                    </div>
                </div>
                <div className="pt-10">
                    <div className="text-[32px] font-medium leading-[35.2px] tracking-[-3%]">
                        Общие положения
                        <div className="pt-3 text-[16px] font-normal leading-[24px] tracking-[-3%]">
                            <br />Настоящее пользовательское Соглашение распространяется на всех Пользователей Приложения, независимо от цели использования, и представляет собой публичную оферту в соответствии со ст. 395 Гражданского кодекса РК. Действие пользовательского соглашения распространяется на Пользователей с момента ввода номера телефона и СМС подтверждения. Нажатие кнопки «Ззаполнить данные» обозначает полное и безоговорочное согласие Пользователя с настоящим пользовательским Соглашением, (акцепт оферты) в соответствии со ст. 395 Гражданского кодекса РК. В случае несогласия с пользовательским Соглашением, Пользователь обязуется прекратить просмотр или пользование Приложением.
                            <br />Действующая редакция пользовательского Соглашения постоянно размещено в Приложение в личном аккаунте пользователя. Компания оставляет за собой право изменять или дополнять настоящее пользовательское Соглашение в любой момент без предварительного или последующего уведомления. Пользователь самостоятельно отслеживает изменения Соглашения и знакомится с действующей редакцией пользовательского соглашения. Продолжение использования Приложения Пользователем после внесения изменений и/или дополнений в настоящее Соглашение означает принятие и согласие Пользователя с такими изменениями и/или дополнениями.
                            <br />При регистрации Пользователь обязан сообщить Приложению свой действующий номер сотового телефона, на который далее поступит смс с кодовыми цифрами которые он далее должен будет ввести в приложение. В случае ошибок или несоответствия части данных следует обратиться в Службу технической поддержки Компании по адресу электронной почты joool.bus@gmail.com
                            <br />Принятием настоящего Соглашения Пользователь дает согласие Приложению на обработку своих персональных данных, переданных им Компании, в соответствии с условиями настоящего Соглашения.
                            <br />После выбора услуги и оплаты, на указанную электронную почту Компания отправит чек об оплате и соответствующие документы на выбранную услугу.
                            <br />Пользователь заходит в приложение, через смс подтверждает свой действующий сотовый номер, далее получает доступ к просмотру автобусных междугородных маршрутов по территории Республики Казахстан и за ее пределами, стоимости цен на билеты с открытыми датами.
                            <br />Пользователь имеет возможность заполнить личные данные в период выбора маршрута, цены, даты, а также позже вкладе «Профиль»
                            <br />При регистрации Пользователь самостоятельно вводит Имя пользователя (логин). Пользователь несет полную ответственность за безопасность выбранных Имени пользователя (логина), в частности за отсутствие к ним доступа у третьих лиц.
                            <br />Пользователь обязуется использовать Приложение только в личных некоммерческих целях в соответствии с настоящим пользовательским Соглашением.
                            <br />Компания обязуется не разглашать преднамеренно информацию о Пользователе, данную им при регистрации, третьим лицам кроме случаев, с контрагентами по заказу и  предусмотренных законодательством РК и нормами международного права.
                            <br />
                            <br />Принимая настоящее Соглашение Пользователь:
                            <br />Подтверждает, что ознакомился с условиями настоящего Соглашения.
                            <br />Обязуется использовать Приложение в соответствии с действующими и применимыми в данной области законами Республики Казахстан.
                            <br />Обязуется не публиковать в открытом доступе информацию полученную в приложение.
                            <br />Обязуется не использовать без согласования с Компанией, Приложения для привлечения внимания других Пользователей к датам, маршрутам, наименования партнёров Приложения, местам и количеству свободных мест и т.д.
                            <br />Пользователь соглашается с правом Компании ограничивать или блокировать доступ к Системе или принимать иные меры в отношении Пользователя, нарушившего условия Соглашения, либо нормы действующего законодательства, либо охраняемые законом права третьих лиц в случае поступления от них мотивированной жалобы.
                            <br />Пользователю запрещается делать скрины и без согласия Компании передавать их третьим лицам, без письменного разрешения Компании. Пользователь признает и соглашается с тем, что любой материал и все необходимые программы, связанные с работой Приложения, защищены законами об интеллектуальной собственности РК и прочими международными законами, а контент, предоставляемый Пользователю в процессе использования Приложения, защищен авторскими правами, торговыми марками, патентами и прочими соответствующими законами.
                            <br />Пользователю запрещено делать скрины, ввести видеосъёмку приложения, распространять материалы приложения, на своей персональной странице (в Блоге и/или Анкете).
                            <br />
                            <br />Компания оставляет за собой право:
                            <br />Модифицировать Приложение по своему усмотрению.
                            <br />Вносить изменения в данное Соглашение в одностороннем порядке без какого-либо специального уведомления. Новая редакция Соглашения вступает в силу с момента ее размещения в Приложение.
                            <br />Отказывать Пользователю в доступе к Приложению в случае нарушения последним условий настоящего Соглашения.
                            <br />Передавать права, полученные от Пользователя по настоящему Соглашению, третьим лицам в целях исполнения настоящего Соглашения без дополнительного согласия Пользователя.
                            <br />Компания сохраняет за собой право проводить модерацию услуг, маршрутов, партнеров и т.д., то есть следить и улучшать качество услуг приложения, в случае необходимости, по собственному усмотрению, без предупреждения и объяснения причин блокировать, удалять пользователей.
                            <br />В случае нарушения условий Соглашения Компания имеет право предпринимать меры, необходимые для защиты этих условий и своих интересов вне зависимости от срока давности этих нарушений. Таким образом, бездействие со стороны Компании при нарушении Пользователями условий Соглашения не лишает Компанию права предпринять необходимые для защиты своих интересов действия позднее и не говорит об отказе Компании от своих прав при совершении подобных нарушений в будущем.
                            <br />
                            <br />Компания не несет ответственности:
                            <br />За содержание, достоверность информации по предоставляемым услугам партнеров.
                            <br />За причинение вреда, ущерб, причиненный партнерами пользователю, или за причинение неудобства, недостоверной информации, которые возникли при пользовании Приложения.
                            <br />Стороны настоящего соглашения соглашаются с тем, что безопасность и защита данных пользователей относятся к важнейшим задачам Компании. В силу чего, Компания обязуется соблюдать предписания закона относительно защиты данных, не подлежащих оглашению.
                            <br />Пользователь уведомлен и согласен с тем, что в соответствии с данным Соглашением Компанией могут быть получены персональные данные — ФИО, ИИН, номер удостоверения, банковская карта, личности, возраст, номер телефона,и т.д.— которые затем сохраняются, обрабатываются и используются Приложением. Персональными данными являются данные такие, которые содержат сведения о личной информации гражданина Республики Казахстан и иностранного гражданина.
                            <br />Кроме того, сохраняются личные настройки пользования, которые Пользователь вводит при использовании Приложения. Этим гарантируется, что каждый Пользователь при следующем посещении (новая сессия — каждый новый вход в систему) может снова найти свои личные настройки.
                            <br />Пользователь разрешает использование Приложению его персональных данных в целях поиска маршрута, билетов, мест и т.д.
                            <br />Пользователь дает разрешение на прием электронных писем от Приложения, смс уведомление по указанному им номеру.
                            <br />Своей регистрацией Пользователь выражает согласие с описанными выше положениями относительно использования его данных.
                            <br />Согласие на принятие, обработку и передачу персональных данных.
                            <br />Регистрируясь в приложение «Joool» нажимая кнопку «сохранить данные» пользователь дает свое согласие на обработку и  передачу своих персональных данных. Согласие касается фамилии, имени, отчества, данных о поле, дате рождении, банковской карте, гражданстве, типе документа, удостоверяющем личность (его серии, номере, дате и месте выдачи), и т.д. на момент подписания настоящего Договора.
                            <br />Пользователь дает свое согласие на использование персональных данных исключительно в для приложения «Joool». Также данным согласием я разрешаю сбор моих персональных данных, их хранение, систематизацию, обновление, использование (в т.ч. передачу третьим лицам для обмена информацией), а также осуществление любых иных действий, предусмотренных действующим законом Республики Казахстан.
                            <br />До моего сведения доведено, что ТОО «_____________» гарантирует обработку и передачу третьим лицам ( партнерам) моих персональных данных в соответствии с действующим законодательством Республики Казахстан. Срок действия данного согласия не ограничен. Согласие может быть отозвано в любой момент по моему письменному заявлению.
                            <br />Используя приложение «Joool» пользователь подтверждает, что,  используя приложение «Joool»дает свое   согласие и действует без принуждения, по собственной воле и в своих интересах.
                            <br /> <br /><span className='text-[32px] font-medium leading-[35.2px] tracking-[-3%]'> Заключительные положения</span>
                            <br /><br />Компания оставляет за собой право незамедлительно без предварительного предупреждения ограничить или блокировать доступа к Приложению или принимать иные меры в отношении Пользователя, нарушившего условия настоящего Соглашения. Кроме того, в случае нарушения Пользователем настоящего соглашения Компания обязуется активно содействовать представителям органов охраны правопорядка в сборе и предоставлении информации о Пользователе, нарушившем настоящее пользовательское соглашение, а также законодательство Республики Казахстан
                            <br />Регистрируясь, Пользователь подтверждает своё безоговорочное согласие со всеми положениями Соглашения, а также своё соответствие всем условиям, отражённым в формах регистрации и необходимыми для успешной регистрации. В определенных  случаях, настоящее Соглашение вступает в силу при акцептации его пользователем в Приложение путем выбора и нажатия Пользователем опции «согласен» (или иной аналогичной опции). пользователь соглашается, что выбор им вышеуказанной опции означает, что он предварительно и в полном объеме ознакомился с условиями настоящего Соглашения и принимает их без каких-либо исключений.
                            <br />Соглашение заключается на неопределенный срок.
                            <br />При регистрации Пользователь входит в приложение «Joool» по номеру телефона, посредством получение смс кода, номер телефона выступает как логин, а смс подтверждением как пароль.
                            <br />Компания вправе в одностороннем порядке отказаться от настоящего Соглашения и прекратить предоставление услуг по пользованию Приложению без возмещения убытков с предварительным уведомлением пользователя расторжении Соглашения не менее, чем за 1 месяц (30 календарных дней). Информирование может быть произведено путем опубликования данной информации в приложение Все изменения, дополнения, приложения к настоящему Соглашению или иная информация являются неотъемлемой его частью и являются обязательными для исполнения с момента опубликования их в приложение, если иное не установлено Приложением.
                            <br />Споры между Компанией и Пользователем разрешаются путем переговоров, а в случае невозможности такого урегулирования в судебном порядке по месту нахождения ТОО «JOOOL» в соответствии с законодательством Республики Казахстан.
                            <br />Отношения сторон по настоящему Соглашению регулируются законодательством Республики Казахстан
                        </div>
                    </div>
                </div>
            </div>
        </>
    );
};

export default ConfidentialityPage;
